app/Helpers/Pengguna_helper.php

SELECT *
FROM `pengguna`
WHERE `pengguna`.`id` = '3'
---
function pengguna_define($id)
{
    $ModelPengguna = new ModelPengguna();
    $pengguna = $ModelPengguna->find($id);

SELECT *
FROM `pengguna`
WHERE `id` = '7'
 LIMIT 1
---
function getLoginDataPengguna(): array
{
    $session = session();
    $ModelPengguna = new ModelPengguna();
    $pengguna = $ModelPengguna->where('id', $session->get('id'))->first();