app/Controllers/Autentikasi.php

SELECT *
FROM `pengguna`
WHERE `nik` = '20930985'
 LIMIT 1
---
    public function valid_login()
    {
        $session = \Config\Services::session();
        $ModelPengguna = new ModelPengguna();
        $data = $this->request->getPost();
        $pengguna = $ModelPengguna->where('nik', $data['nik'])->first();