app/Controllers/ClosedTask.php

SELECT *
FROM `tiket_reguler`
WHERE `petugas` = '4'
---
    public function input()
    {
        $data['title'] = "Tiket";
        $data['pengguna'] = getLoginDataPengguna();

        // Get all tickets assigned to the logged-in user (assuming 'petugas' is the logged-in user ID)
        $ModelTiketReguler = new ModelTiketReguler();
        $data['tiket_reguler'] = $ModelTiketReguler->where('petugas', $data['pengguna']['id'])->findAll();

UPDATE `tiket_reguler` SET `jenis_pekerjaan` = '2', `sto` = '1', `hasil_pengecekan` = 'OK', `hasil_perbaikan` = 'YES', `tgl_selesai` = '2024-12-30 07:11:29', `status` = 3
WHERE `tiket_reguler`.`id_tiket_reguler` IN ('2')
---
                'status' => 3,
            ];

            $modelTiketReguler->update($tiket['id_tiket_reguler'], $updateData);

INSERT INTO `bukti_tiket` (`gambar1`, `gambar2`, `gambar3`, `gambar4`, `gambar5`, `no_tiket`) VALUES ('1735542689_45b77a5b34ad1dff5104.jpg', '1735542689_18b8418b438b57ca7a3b.png', '1735542689_bb353cfcd3103cd9344c.png', '1735542689_e0869b3ff12eea9e6c11.jpg', '1735542689_cd346dd2896c5031a650.jpg', '98239469LOPK')
---
            if (!empty($gambarData)) {
                $modelBuktiTiket = new ModelBuktiTiket();
                $gambarData['no_tiket'] = $data['no_tiket']; // Tambahkan no_tiket untuk menghubungkan
                $modelBuktiTiket->insert($gambarData);