app/Controllers/ClosedTask.php

    public function input()
    {
        $data['title'] = "Tiket";
        $data['pengguna'] = getLoginDataPengguna();

        // Get all tickets assigned to the logged-in user (assuming 'petugas' is the logged-in user ID)
        $ModelTiketReguler = new ModelTiketReguler();
        $data['tiket_reguler'] = $ModelTiketReguler
            ->groupStart() // Mulai grup untuk logika OR
            ->where('petugas', $data['pengguna']['id'])
            ->orWhere('petugas2', $data['pengguna']['id'])
            ->groupEnd() // Akhiri grup
            ->findAll(); // Ambil semua hasil
---
SELECT *
FROM `tiket_reguler`
WHERE   (
`petugas` = '4'
OR `petugas2` = '4'
 )