app/Controllers/Dashboard.php

    public function index()
{
    $modelTiketReguler = new \App\Models\ModelTiketReguler();
    $modelPengguna = new \App\Models\ModelPengguna();

    // Mengambil data petugas yang memiliki hak akses = 2
    $petugas = $modelPengguna->where('hak_akses', 2)->findAll();

    // Inisialisasi variabel untuk menyimpan data ringkasan
    $openCount = 0;
    $inProgressCount = 0;
    $closedCount = 0;
    $allCount = 0;

    // Menghitung jumlah tiket berdasarkan status
    foreach ($petugas as $user) {
        // Hitung tiket dengan status 'Open' (status = 1)
        $open = $modelTiketReguler->where('status', 1)->where('petugas', $user['id'])->countAllResults();

        // Hitung tiket dengan status 'In Progress' (status = 2)
        $inProgress = $modelTiketReguler->where('status', 2)->where('petugas', $user['id'])->countAllResults();

        // Hitung tiket dengan status 'Closed' (status = 3)
        $closed = $modelTiketReguler->where('status', 3)->where('petugas', $user['id'])->countAllResults();

        // Hitung semua tiket untuk petugas ini
        $all = $modelTiketReguler->where('petugas', $user['id'])->countAllResults();
---
SELECT *
FROM `pengguna`
WHERE `hak_akses` = 2
SELECT COUNT(*) AS `numrows`
FROM `tiket_reguler`
WHERE `status` = 1
AND `petugas` = '3'
SELECT COUNT(*) AS `numrows`
FROM `tiket_reguler`
WHERE `status` = 2
AND `petugas` = '3'
SELECT COUNT(*) AS `numrows`
FROM `tiket_reguler`
WHERE `status` = 3
AND `petugas` = '3'
SELECT COUNT(*) AS `numrows`
FROM `tiket_reguler`
WHERE `petugas` = '3'