app/Controllers/Dashboard.php

    public function index()
    {
        $modelTiketReguler = new \App\Models\ModelTiketReguler();
        $modelPengguna = new \App\Models\ModelPengguna();

        // Mengambil data petugas yang memiliki hak akses = 2
        $petugas = $modelPengguna->where('hak_akses', 2)->findAll();

        // Inisialisasi variabel untuk menyimpan data ringkasan
        $openCount = 0;
        $inProgressCount = 0;
        $closedCount = 0;
        $allCount = 0;

        // Menghitung jumlah tiket berdasarkan status
        foreach ($petugas as $user) {
            // Hitung tiket dengan status 'Open' (status = 1)
            // Hitung tiket dengan status 'Open' (status = 1)
            $open = $modelTiketReguler
                ->groupStart() // Mulai grup
                ->where('status', 1)
                ->groupStart() // Grup untuk kondisi OR
                ->where('petugas', $user['id'])
                ->orWhere('petugas2', $user['id'])
                ->groupEnd()
                ->groupEnd()
                ->countAllResults();

            // Hitung tiket dengan status 'In Progress' (status = 2)
            $inProgress = $modelTiketReguler
                ->groupStart()
                ->where('status', 2)
                ->groupStart()
                ->where('petugas', $user['id'])
                ->orWhere('petugas2', $user['id'])
                ->groupEnd()
                ->groupEnd()
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tiket_reguler`
WHERE   (
`status` = 2
AND    (
`petugas` = '3'
OR `petugas2` = '3'
  )
 )