app/Controllers/MyTask.php

    public function list_reguler()
    {
        $data['title'] = "Tiket";

        // Get the current logged-in user's ID (assuming getLoginDataPengguna() returns the logged-in user data)
        $data['pengguna'] = getLoginDataPengguna();

        // Fetch the logged-in user's ID (assuming 'id' is the field for user ID)
        $user_id = $data['pengguna']['id'];

        // Load the Tiket Reguler model
        $ModelTiketReguler = new ModelTiketReguler();

        // Fetch Tiket Reguler data where 'petugas' equals the logged-in user's ID
        $data['tiket_reguler'] = $ModelTiketReguler
            ->where('petugas', $user_id)  // Filter by 'petugas' (current logged-in user)
            ->orderBy('id_tiket_reguler', 'DESC')  // Order by ticket ID (descending)
            ->findAll();  // Fetch all matching records
---
SELECT *
FROM `tiket_reguler`
WHERE `petugas` = '7'
ORDER BY `id_tiket_reguler` DESC