app/Controllers/MyTask.php

SELECT *
FROM `tiket_reguler`
WHERE   (
`petugas` = '4'
OR `petugas2` = '4'
 )
ORDER BY `id_tiket_reguler` DESC
---
    public function list_reguler()
    {
        $data['title'] = "Tiket";

        // Get the current logged-in user's ID (assuming getLoginDataPengguna() returns the logged-in user data)
        $data['pengguna'] = getLoginDataPengguna();

        // Fetch the logged-in user's ID (assuming 'id' is the field for user ID)
        $user_id = $data['pengguna']['id'];

        // Load the Tiket Reguler model
        $ModelTiketReguler = new ModelTiketReguler();

        // Fetch Tiket Reguler data where 'petugas' equals the logged-in user's ID
        $data['tiket_reguler'] = $ModelTiketReguler
            ->groupStart() // Mulai grup kondisi
            ->where('petugas', $user_id) // Kondisi pertama
            ->orWhere('petugas2', $user_id) // Kondisi kedua
            ->groupEnd() // Akhir grup kondisi
            ->orderBy('id_tiket_reguler', 'DESC') // Urutkan berdasarkan ID tiket secara descending
            ->findAll(); // Ambil semua hasil