app/Controllers/Pengguna.php

SELECT *
FROM `pengguna`
---
    public function index()
    {
        $ModelPengguna = new ModelPengguna();
        $data['pengguna'] = getLoginDataPengguna();
        $data['title'] = "Pengguna";
        $data['daftar_pengguna'] = $ModelPengguna->findAll();