app/Controllers/TiketReguler.php

SELECT *
FROM `tiket_reguler`
ORDER BY `id_tiket_reguler` DESC
---
    public function index()
    {
        $data['title'] = "Tiket";
        $data['pengguna'] = getLoginDataPengguna(); // If needed for current logged-in user info

        // Load models
        $ModelTiketReguler = new ModelTiketReguler();
        $ModelPengguna = new ModelPengguna();

        // Fetch all tickets ordered by id
        $data['tiket_reguler'] = $ModelTiketReguler->orderBy('id_tiket_reguler', 'DESC')->findAll();