app/Models/ModelPengguna.php

SELECT *
FROM `pengguna`
WHERE `hak_akses` = 2
---
    public function getByHakAkses($hak_akses = 2)
    {
        // Use where() to filter by hak_akses = 2
        return $this->where('hak_akses', $hak_akses)->findAll();