app/Models/ModelTiketReguler.php

SELECT *
FROM `tiket_reguler`
WHERE `no_tiket` = '98239469LOPK'
 LIMIT 1
---
    public function getDataByNoTiket($noTiket)
    {
        return $this->where('no_tiket', $noTiket)->first();